bedV02MomentumSource_NoSouces/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          	[0 1 -1 0 0 0 0];

internalField       	uniform (0 0 0);

boundaryField
{
    inletAir
    {
        type            pressureInletOutletVelocity;
        phi             phi.air;
        value           $internalField;
    }
    
    inletWater
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            pressureInletOutletVelocity;
        phi             phi.air;
        value           $internalField;
    }
    sym
    {
    	type		symmetry;
    }
    walls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
