bedV02MomentumSource_NoSouces/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 1e5;

boundaryField
{
    
    inletAir
    {
        type            totalPressure;
        U		U.air;
	p0              uniform 1e5;	
    }
    
    inletWater
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    bottom
    {
        type            prghTotalPressure;
        p0              $internalField;
        U               U.water;
        phi             phi.water;
        rho             rho.water;
        value           $internalField;
    }
    sym
    {
    	type		symmetry;
    }
    walls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
