bedV02MomentumSource_NoSouces/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
    volScalarFieldValue alpha.solid 0
);

regions
(
    boxToCell
    {
        box (0 -0.1 -0.1) (0.15 1 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.6
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.solid 0.4
        );
    }
);


// ************************************************************************* //
